TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПланыРазгрузкиСудов/гкс_ПланыРазгрузкиСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПланыРазгрузкиСудов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ВидыОперацийФрахта/гкс_ВидыОперацийФрахта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ВидыОперацийФрахта</name>
  <enumValues>
    <name>ОтгрузкаПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПоставкаСырья</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ТранспортныйДокумент/гкс_ТранспортныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ТранспортныйДокумент</name>
  <registerRecords>InformationRegister.гкс_ЖДНакладныеВагона</registerRecords>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.гкс_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДокументПЛК</name>
    <comment>Документ создан в текущей базе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОВодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ПрибытиеСуднаНаПЛК/гкс_ПрибытиеСуднаНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ПрибытиеСуднаНаПЛК</name>
  <basedOn>Document.гкс_Фрахт</basedOn>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ТранспортныеДокументыФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеДокументы</name>
    <attributes>
      <name>ТранспортныйДокумент</name>
      <type>
        <types>DocumentRef.гкс_ТранспортныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВТрюме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Фрахт/гкс_Фрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_Фрахт</name>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ПланыРазгрузкиСудов</registerRecords>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.гкс_СтатусыСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийФрахта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбработкиСудна</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОчередностьОбработки</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропорцияСмешивания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_МорскаяЛогистикаВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ВесПоТранспортномуДокументу(ТранспортныйДокумент) Экспорт
	
	Вес = 0;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТранспортныйДокумент", ТранспортныйДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ТранспортныйДокументТранспортныеСредства.ВесНетто) КАК ВесНетто
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка = &ТранспортныйДокумент";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Вес = Выборка.ВесНетто;
	КонецЕсли;
	
	Возврат Вес;
	
КонецФункции

Функция ДанныеЗаполненияПрибытияСуднаНаПЛК(Фрахт) Экспорт
	
	Реквизиты = Новый Структура;
	ТранспортныеДокументы = Новый Массив;
	ТаблицыЗапроса = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.Текст = ТекстЗапросаДанныеЗаполненияПрибытияСуднаНаПЛК(ТаблицыЗапроса);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[ТаблицыЗапроса.Реквизиты].Пустой() Тогда
		Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(
			РезультатЗапроса[ТаблицыЗапроса.Реквизиты].Выгрузить()[0]);
	КонецЕсли;
	
	Если Не РезультатЗапроса[ТаблицыЗапроса.ТранспортныеДокументы].Пустой() Тогда
		ТранспортныеДокументы = ОбщегоНазначения.ТаблицаЗначенийВМассив(
			РезультатЗапроса[ТаблицыЗапроса.ТранспортныеДокументы].Выгрузить());
	КонецЕсли;
	
	ДанныеЗаполнения 	= Новый Структура;
	ДанныеЗаполнения.Вставить("Реквизиты", Реквизиты);
	ДанныеЗаполнения.Вставить("ТранспортныеДокументы", ТранспортныеДокументы);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ТекстЗапросаДанныеЗаполненияПрибытияСуднаНаПЛК(ТаблицыЗапроса)
	
	ТаблицыЗапроса.Вставить("ПланыРазгрузкиСудов", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("Реквизиты", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ТранспортныеДокументы", ТаблицыЗапроса.Количество());
	
	Возврат  
	"ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Фрахт КАК Фрахт,
	|	ПланыРазгрузкиСудов.Номенклатура КАК Номенклатура,
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм,
	|	ПланыРазгрузкиСудов.Количество КАК Количество,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ПланыРазгрузкиСудов.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПланыРазгрузкиСудов
	|ИЗ
	|	РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|ГДЕ
	|	ПланыРазгрузкиСудов.Фрахт = &Фрахт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланыРазгрузкиСудов.Фрахт КАК Фрахт,
	|	ПланыРазгрузкиСудов.Номенклатура КАК Номенклатура,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
	|ИЗ
	|	ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|СГРУППИРОВАТЬ ПО
	|	ПланыРазгрузкиСудов.Фрахт,
	|	ПланыРазгрузкиСудов.Номенклатура,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм,
	|	ПланыРазгрузкиСудов.Порядок КАК Порядок,
	|	СУММА(ПланыРазгрузкиСудов.Количество) КАК КоличествоВТрюме
	|ИЗ
	|	ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|СГРУППИРОВАТЬ ПО
	|	ПланыРазгрузкиСудов.Трюм,
	|	ПланыРазгрузкиСудов.Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм";
	
КонецФункции

// Возвращает коллекцию транспортных документов по судну в виде массива.
// 
// Параметры:
//  Судно - СправочникСсылка.ТранспортныеСредства - Судно для поиска записей
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.гкс_ТранспортныйДокумент - Коллекция транспортных документов по судну
Функция КоллекцияТранспортныхДокументовПоСудну(Судно) Экспорт
	
	КоллекцияТранспортныхДокументов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТранспортноеСредство", Судно);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныйДокумент.Ссылка КАК Коносамент,
	|	ТранспортныйДокумент.Дата КАК КоносаментДата
	|ПОМЕСТИТЬ ТранспортныеДокументыПоСудну
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО ТранспортныйДокументТранспортныеСредства.Ссылка = ТранспортныйДокумент.Ссылка
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.ТранспортноеСредство = &ТранспортноеСредство
	|	И НЕ ТранспортныйДокумент.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеДокументыПоСудну.Коносамент КАК Коносамент
	|ИЗ
	|	ТранспортныеДокументыПоСудну КАК ТранспортныеДокументыПоСудну
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК.ТранспортныеДокументы КАК ТранспортныеДокументыОформленные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК КАК ДокументПрибытиеСуднаНаПЛК
	|			ПО ТранспортныеДокументыОформленные.Ссылка = ДокументПрибытиеСуднаНаПЛК.Ссылка
	|			И НЕ ДокументПрибытиеСуднаНаПЛК.ПометкаУдаления
	|		ПО ТранспортныеДокументыПоСудну.Коносамент = ТранспортныеДокументыОформленные.ТранспортныйДокумент
	|ГДЕ
	|	ТранспортныеДокументыОформленные.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТранспортныеДокументыПоСудну.КоносаментДата";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		КоллекцияТранспортныхДокументов = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатЗапроса.Выгрузить(), "Коносамент", Истина);
	КонецЕсли;
	
	Возврат КоллекцияТранспортныхДокументов;
	
КонецФункции

// Возвращает коллекцию Фрахтов, не использованных в документах Прибытие судна на ПЛК в виде массива.
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.гкс_Фрахт - Фрахты, не привязанные к Прибытию судна на ПЛК.
Функция КоллекцияНеобработанныхФрахтов() Экспорт
	
	КоллекцияДокументов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументФрахт.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_Фрахт КАК ДокументФрахт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК КАК ДокументПрибытиеСуднаНаПЛК
	|		ПО ДокументПрибытиеСуднаНаПЛК.Фрахт = ДокументФрахт.Ссылка
	|		И НЕ ДокументПрибытиеСуднаНаПЛК.ПометкаУдаления
	|ГДЕ
	|	ДокументФрахт.Проведен
	|	И ДокументФрахт.ВидОперации = ЗНАЧЕНИЕ(Перечисление.гкс_ВидыОперацийФрахта.ПоставкаСырья)
	|	И ДокументПрибытиеСуднаНаПЛК.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		КоллекцияДокументов = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатЗапроса.Выгрузить(), "Ссылка", Истина);
	КонецЕсли;
	
	Возврат КоллекцияДокументов;
	
КонецФункции

// см. гкс_МорскаяЛогистика.ФрахтПоДокументуРегистрации
//
Функция ФрахтПоДокументуРегистрации(ДокументРегистрации) Экспорт
	Возврат гкс_МорскаяЛогистика.ФрахтПоДокументуРегистрации(ДокументРегистрации);
КонецФункции

// см. гкс_МорскаяЛогистика.ТрюмыФрахта
//
Функция ТрюмыФрахта(Фрахт) Экспорт
	
	Возврат гкс_МорскаяЛогистика.ТрюмыФрахта(Фрахт);
	
КонецФункции

// см. гкс_МорскаяЛогистика.СменыФрахта
//
Функция СменыФрахта(Фрахт, ТолькоОткрытые = Ложь) Экспорт
	
	Возврат гкс_МорскаяЛогистика.СменыФрахта(Фрахт, ТолькоОткрытые);
	
КонецФункции

#КонецОбласти
